Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If a match is found, and the server is willing to re-establish the connection under the specified session state, it will send a ServerHello with the same Session ID value.
zh_cn: 如果找到匹配项，并且服务器愿意在指定的会话状态下重新建立连接，它将发送具有相同会话 ID 值的 ServerHello。

source: If a match is found, the client MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果找到匹配项，客户端必须通过“illegal_parameter”警报中止握手。

source: If a message body has been indicated, then it is read as a stream until an amount of octets equal to the message body length is read or the connection is closed.
zh_cn: 如果已指示消息体，则将其作为流读取，直到读取等于消息体长度的八位字节数或关闭连接。

source: If a message is received that has multiple Content-Length header fields with field-values consisting of the same decimal value, or a single Content-Length header field with a field value containing a list of identical decimal values (e.g., "Content-Length: 42, 42"), indicating that duplicate Content-Length header fields have been generated or combined by an upstream message processor, then the recipient MUST either reject the message as invalid or replace the duplicated field-values with a single valid Content-Length field containing that decimal value prior to determining the message body length or forwarding the message.
zh_cn: 如果收到的消息具有多个 Content-Length 首部字段，其字段值包含相同的十进制值，或者单个 Content-Length 首部字段，其字段值包含相同十进制值的列表(例如，"Content-Length: 42, 42")，表示上游消息处理器生成或组合了重复的 Content-Length 首部字段，然后接收者必须要么拒绝该消息为无效，要么用单个有效的包含十进制值的 Content-Length 字段替换重复的字段值，在确定消息正文长度或转发消息之前。

source: If a message is received with both a Transfer-Encoding and a Content-Length header field, the Transfer-Encoding overrides the Content-Length.
zh_cn: 如果收到包含 Transfer-Encoding 和 Content-Length 首部字段的消息，则 Transfer-Encoding 将覆盖 Content-Length。

source: If a message is received with both a Transfer-Encoding header field and a Content-Length header field, the latter MUST be ignored.
zh_cn: 如果收到带有 Transfer-Encoding 首部字段和 Content-Length 首部字段的消息，则必须忽略后者。

source: If a message is received without Transfer-Encoding and with either multiple Content-Length header fields having differing field-values or a single Content-Length header field having an invalid value, then the message framing is invalid and the recipient MUST treat it as an unrecoverable error.
zh_cn: 如果在没有 Transfer-Encoding 的情况下收到消息并且具有不同字段值的多个 Content-Length 首部字段或具有无效值的单个 Content-Length 首部字段，则消息成帧无效且接收者必须将其视为不可恢复的错误。

source: If a new resource is created, the origin server MUST inform the user agent via the 201 (Created) response.
zh_cn: 如果创建了新资源，则源服务器必须通过 201(已创建)响应通知用户代理。

source: If a parameter has a quality value of 0, then content with this parameter is `not acceptable' for the client.
zh_cn: 如果参数的质量值为 0，则具有此参数的内容对于客户端来说是“不可接受的”。

source: If a proxy is applicable, the client connects inbound by establishing (or reusing) a connection to that proxy.
zh_cn: 如果代理适用，则客户端通过建立(或重用)与该代理的连接来连接入站。

source: If a proxy receives a fully qualified domain name, the proxy MUST NOT change the host name.
zh_cn: 如果代理收到完全限定的域名，则代理不得更改主机名。

source: If a proxy receives a host name which is not a fully qualified domain name, it MAY add its domain to the host name it received.
zh_cn: 如果代理收到的主机名不是完全限定的域名，则可以将其域添加到收到的主机名中。

source: If a proxy receives an OPTIONS request with an absolute-form of request-target in which the URI has an empty path and no query component, then the last proxy on the request chain MUST send a request-target of "*" when it forwards the request to the indicated origin server.
zh_cn: 如果代理接收到具有绝对形式的 request-target 的 OPTIONS 请求，其中 URI 具有空路径且没有查询组件，那么请求链上的最后一个代理必须在转发时发送请求目标“*”对指定的源服务器的请求。

source: If a request contains a message-body and a Content-Length is not given, the server SHOULD respond with 400 (bad request) if it cannot determine the length of the message, or with 411 (length required) if it wishes to insist on receiving a valid Content-Length.
zh_cn: 如果一个请求包含一个消息体并且没有给出 Content-Length，那么服务器应该响应 400(错误的请求)，如果它不能确定消息的长度，或者如果它坚持希望收到有效的内容长度，则应该响应 411(需要的长度)。

source: If a reserved character is found in a URI component and no delimiting role is known for that character, then it must be interpreted as representing the data octet corresponding to that character's encoding in US-ASCII.
zh_cn: 如果在 URI 组件中找到保留字符且该字符不知道分隔角色，则必须将其解释为表示与 US-ASCII 中该字符的编码对应的数据八位字节。

source: If a resource has been created on the origin server, the response SHOULD be 201 (Created) and contain an entity which describes the status of the request and refers to the new resource, and a Location header (see section 14.30).
zh_cn: 如果在源服务器上创建了资源，则响应应该是 201(已创建)并包含描述请求状态的实体，并引用新资源和 Location 首部(请参阅第 14.30 节)。

source: If a response terminates in the middle of the header section (before the empty line is received) and the status code might rely on header fields to convey the full meaning of the response, then the client cannot assume that meaning has been conveyed; the client might need to repeat the request in order to determine what action to take next.
zh_cn: 如果响应终止于首部部分的中间(在接收空行之前)并且状态代码可能依赖于首部字段来传达响应的完整含义，则客户端不能假定已经传达了意义；客户端可能需要重复请求以确定接下来要采取的操作。

source: If a segment contains an odd number of header and text octets to be checksummed, the last octet is padded on the right with zeros to form a 16 bit word for checksum purposes.
zh_cn: 如果一个报文段包含的求校验和的首部和文本八位字节是奇数，则最后一个八位字节在右边用零填充，形成一个 16 位字用于求校验和。

source: If a server established a TLS connection with a previous version of TLS and receives a TLS 1.3 ClientHello in a renegotiation, it MUST retain the previous protocol version.
zh_cn: 如果服务器与先前版本的 TLS 建立 TLS 连接并在重新协商中收到 TLS 1.3 ClientHello，则它必须保留先前的协议版本。

source: If a server has such knowledge (typically from some source external to HTTP or TLS) it SHOULD check the identity as described above.
zh_cn: 如果服务器具有这样的知识(通常来自 HTTP 或 TLS 外部的某些源)，它应该如上所述检查身份。

source: If a server is authenticating via a certificate and the client has not sent a "signature_algorithms" extension, then the server MUST abort the handshake with a "missing_extension" alert (see Section 9.2).
zh_cn: 如果服务器通过证书进行身份验证，并且客户端没有发送“signature_algorithms”扩展，那么服务器必须使用“missing_extension”警报中止握手(参见第 9.2 节)。

source: If a server performs an immediate close of a TCP connection, there is a significant risk that the client will not be able to read the last HTTP response.
zh_cn: 如果服务器立即关闭 TCP 连接，则存在客户端无法读取最后一个 HTTP 响应的重大风险。

source: If a server receives both an Upgrade and an Expect header field with the "100-continue" expectation (Section 5.1.1 of [RFC7231]), the server MUST send a 100 (Continue) response before sending a 101 (Switching Protocols) response.
zh_cn: 如果服务器同时收到具有“100-continue”期望的 Upgrade 和 Expect 首部字段([RFC7231] 的第 5.1.1 节)，则服务器必须在发送 101(交换协议)响应之前发送 100(继续)响应。

source: If a session is resumed, it must be resumed using the same cipher suite it was originally negotiated with.
zh_cn: 如果恢复会话，则必须使用最初协商的相同加密套件恢复该会话。

source: If a subjectAltName extension of type dNSName is present, that MUST be used as the identity.
zh_cn: 如果存在类型为 dNSName 的 subjectAltName 扩展名，则必须将其用作标识。

source: If a valid Content-Length header field is present without Transfer-Encoding, its decimal value defines the expected message body length in octets.
zh_cn: 如果在没有 Transfer-Encoding 的情况下存在有效的 Content-Length 首部字段，则其十进制值以八位字节定义预期的消息体长度。

source: If an ACK is not forthcoming, after the user timeout the connection is aborted and the user is told.
zh_cn: 如果没有即将发出 ACK，则在用户超时后，中止连接并告知用户。

source: If an HTTP/1.1 client sends a request which includes a request body, but which does not include an Expect request-header field with the "100-continue" expectation, and if the client is not directly connected to an HTTP/1.1 origin server, and if the client sees the connection close before receiving any status from the server, the client SHOULD retry the request.
zh_cn: 如果 HTTP/1.1 客户端发送包含请求主体的请求，但不包含具有“100-continue”期望的 Expect 请求首部字段，并且客户端未直接连接到 HTTP/1.1 源服务器，如果客户端在从服务器接收任何状态之前看到连接关闭，则客户端应该重试该请求。

source: If an alert with a level of warning is sent and received, generally the connection can continue normally.
zh_cn: 如果发送和接收具有警告级别的警报，通常连接可以正常继续。

source: If an application receives an unrecognized multipart subtype, the application MUST treat it as being equivalent to "multipart/mixed".
zh_cn: 如果应用程序收到无法识别的多部分子类型，则应用程序必须将其视为等同于“multipart/mixed”。

source: If an entity-body is encoded with a content-coding, the underlying data MUST be in a form defined above prior to being encoded.
zh_cn: 如果实体主体使用内容编码进行编码，则基础数据必须采用上面定义的形式，然后再进行编码。

source: If an existing resource is modified, either the 200 (OK) or 204 (No Content) response codes SHOULD be sent to indicate successful completion of the request.
zh_cn: 如果修改了现有资源，则应该发送 200(OK)或 204(No Content)响应代码以指示请求的成功完成。

source: If an extension applies to the entire chain, it SHOULD be included in the first CertificateEntry.
zh_cn: 如果扩展适用于整个链，它应该包含在第一个 CertificateEntry 中。

source: If an implementation detects a change_cipher_spec record received before the first ClientHello message or after the peer's Finished message, it MUST be treated as an unexpected record type (though stateless servers may not be able to distinguish these cases from allowed cases).
zh_cn: 如果实现检测到在第一个 ClientHello 消息之前或在对等端的 Finished 消息之后收到的 change_cipher_spec 记录，则必须将其视为意外记录类型(尽管无状态服务器可能无法将这些情况与允许的情况区分开)。

source: If an implementation receives an extension which it recognizes and which is not specified for the message in which it appears, it MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果某个实现接收到它识别的扩展，但它出现的消息没有指定，那么它必须使用“illegal_parameter”警报中止握手。

source: If an incoming segment has a security level, or compartment, or precedence which does not exactly match the level, and compartment, and precedence requested for the connection,a reset is sent and connection goes to the CLOSED state.
zh_cn: 如果传入的报文段具有与连接请求的级别，compartment 和优先级不完全匹配的安全级别，compartment 或优先级，则会发送重置并且连接将进入 CLOSED 状态。

source: If an operator has to offer a reactive base type, however, the user will receive the full reactive class (as giving out an `XSource` is practically useless as it doesn't have operators on it):
zh_cn: 但是，如果操作符必须提供响应型基类型，则用户将收到完整的响应类(因为它没有运算符，因此发出 `XSource` 实际上是无用的)：

source: If an undeliverable exception is an instance/descendant of `NullPointerException`, `IllegalStateException` (`UndeliverableException` and `ProtocolViolationException` extend this), `IllegalArgumentException`, `CompositeException`, `MissingBackpressureException` or `OnErrorNotImplementedException`, the `UndeliverableException` wrapping doesn't happen.
zh_cn: 如果一个无法传递的异常是 `NullPointerException` 的实例/后代，`IllegalStateException`(`UndeliverableException` 和 `ProtocolViolationException` 扩展了它)，`IllegalArgumentException`，`CompositeException`，`MissingBackpressureException` 或 `OnErrorNotImplementedException`，那么 `UndeliverableException` 包装不会发生。

source: If an unsolicited FIN arrives from the network, the receiving TCP can ACK it and tell the user that the connection is closing.
zh_cn: 如果未经请求的 FIN 从网络到达，则接收 TCP 可以确认它并告诉用户连接正在关闭。

source: If and only if the media type is not given by a Content-Type field, the recipient MAY attempt to guess the media type via inspection of its content and/or the name extension(s) of the URI used to identify the resource.
zh_cn: 当且仅当媒体类型未由 Content-Type 字段给出时，接收者可以尝试通过检查其内容和/或用于标识资源的 URI 的名称扩展名来猜测媒体类型。

source: If any of these checks fail, the server MUST NOT respond with the extension and must discard all the first-flight data using one of the first two mechanisms listed above (thus falling back to 1-RTT or 2-RTT).
zh_cn: 如果这些检查中的任何一个失败，则服务器不得使用扩展进行响应，并且必须使用上面列出的前两种机制之一丢弃所有首先飞行数据(因此回退到 1-RTT 或 2-RTT)。

source: If any transfer coding other than chunked is applied to a request payload body, the sender MUST apply chunked as the final transfer coding to ensure that the message is properly framed.
zh_cn: 如果除了 chunked 之外的任何传输编码被应用于请求有效载荷主体，则发送方必须应用 chunked 作为最终传输编码以确保消息被正确地成帧。

source: If any transfer coding other than chunked is applied to a response payload body, the sender MUST either apply chunked as the final transfer coding or terminate the message by closing the connection.
zh_cn: 如果除了 chunked 之外的任何传输编码被应用于响应有效载荷主体，则发送方必须应用 chunked 作为最终传输编码或通过关闭连接来终止消息。

source: If at any point an error status is received, the client
zh_cn: 如果在任何时候收到错误状态，则客户端

source: If at site A the connection no longer exists, then an attempt by the user at site B to send any data on it will result in the site B TCP receiving a reset control message.
zh_cn: 如果在站点 A 处连接不再存在，则站点 B 处的用户尝试在其上发送任何数据将导致站点 B TCP 接收重置控制消息。

source: If client does receive a MD5 or SHA-1 signature in the ServerKeyExchange message it MUST abort the connection with handshake_failure or insufficient_security alert.
zh_cn: 如果客户端确实在 ServerKeyExchange 消息中收到 MD5 或 SHA-1 签名，则它必须使用 handshake_failure 或 insufficient_security 警报中止连接。

source: If client sees that the connection is closed prematurely, repeat from step 1 until the request is accepted, an error response is received, or the user becomes impatient and terminates the retry process.
zh_cn: 如果客户端看到连接过早关闭，则从步骤 1 开始重复，直到接受请求，收到错误响应，或者用户变得不耐烦并终止重试过程。

source: If clients offer "pre_shared_key" without a "psk_key_exchange_modes" extension, servers MUST abort the handshake.
zh_cn: 如果客户端提供“pre_shared_key”而没有“psk_key_exchange_modes”扩展，则服务器必须中止握手。

source: If data for a URI component would conflict with a reserved character's purpose as a delimiter, then the conflicting data must be percent-encoded before the URI is formed.
zh_cn: 如果 URI 组件的数据与保留字符作为分隔符的目的冲突，则冲突数据必须在形成 URI 之前进行百分比编码。

source: If early data is in use, the client may transmit early Application Data (Section 2.3) while waiting for the next handshake message.
zh_cn: 如果正在使用早期数据，则客户端可以在等待下一个握手消息的同时发送早期应用数据(第 2.3 节)。

source: If either of these checks fails, then the client MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果这些检查中的任何一个失败，那么客户端必须通过“illegal_parameter”警报中止握手。

source: If either the client or the server sends the close token in the Connection header, that request becomes the last one for the connection.
zh_cn: 如果客户端或服务器在 Connection 首部中发送关闭标记，则该请求将成为连接的最后一个请求。

source: If host is a registered name, the registered name is an indirect identifier for use with a name resolution service, such as DNS, to find an address for that origin server.
zh_cn: 如果 host 是注册名称，则注册名称是与名称解析服务(如 DNS)一起使用的间接标识符，用于查找该源服务器的地址。

source: If host matches the rule for IPv4address, then it should be considered an IPv4 address literal and not a reg-name.
zh_cn: 如果主机匹配 IPv4address 的规则，则应将其视为 IPv4 地址文字，而不是注册名称。

source: If it cannot find such a match, it will respond with a handshake failure alert.
zh_cn: 如果找不到这样的匹配，它将以握手失败警报响应。

source: If it is not, the server SHOULD proceed with the handshake but reject 0-RTT, and SHOULD NOT take any other action that assumes that this ClientHello is fresh.
zh_cn: 如果不是，服务器应该继续握手但拒绝 0-RTT，并且不应采取任何其他假设此 ClientHello 是新鲜的操作。

source: If it responds with a final status code, it MAY close the transport connection or it MAY continue to read and discard the rest of the request.
zh_cn: 如果它以最终状态代码响应，它可以关闭传输连接，或者它可以继续读取并丢弃请求的其余部分。

source: If more than one identity of a given type is present in the certificate (e.g., more than one dNSName name, a match in any one of the set is considered acceptable.) Names may contain the wildcard character * which is considered to match any single domain name component or component fragment.
zh_cn: 如果证书中存在多个给定类型的标识(例如，多个 dNSName 名称，则认为任何一个集合中的匹配都是可接受的。)名称可以包含通配符 *，该通配符被认为与任何单个匹配域名组件或组件片段匹配。

source: If negotiating TLS 1.1 or below, TLS 1.3 servers MUST, and TLS 1.2 servers SHOULD, set the last 8 bytes of their ServerHello.Random value to the bytes:
zh_cn: 如果协商 TLS 1.1 或更低版本，TLS 1.3 服务器必须，并且 TLS 1.2 服务器应该将其 ServerHello.Random 值的最后 8 个字节设置为字节：

source: If negotiating TLS 1.2, TLS 1.3 servers MUST set the last 8 bytes of their Random value to the bytes:
zh_cn: 如果协商 TLS 1.2，TLS 1.3 服务器必须将其 Random 值的最后 8 个字节设置为字节：

source: If negotiating a version of TLS prior to 1.3, a server MUST check that the message either contains no data after legacy_compression_methods or that it contains a valid extensions block with no data following.
zh_cn: 如果协商一个 TLS 1.3 之前的版本，服务器必须检查该消息是否在 legacy_compression_methods 之后不包含数据，或者它包含一个没有数据的有效扩展块。

source: If no "signature_algorithms_cert" extension is present, then the "signature_algorithms" extension also applies to signatures appearing in certificates.
zh_cn: 如果不存在“signature_algorithms_cert”扩展，则“signature_algorithms”扩展也适用于证书中出现的签名。

source: If no Max-Forwards field is present in the request, then the forwarded request MUST NOT include a Max-Forwards field.
zh_cn: 如果请求中不存在 Max-Forwards 字段，则转发的请求不得包含 Max-Forwards 字段。

source: If no common cryptographic parameters can be negotiated, the server MUST abort the handshake with an appropriate alert.
zh_cn: 如果无法协商通用加密参数，则服务器必须使用适当的警报中止握手。

source: If no error response is received, after T seconds transmit the body of the request.
zh_cn: 如果没有收到错误响应，则在 T 秒之后发送请求的正文。

source: If no proxy is applicable, a typical client will invoke a handler routine, usually specific to the target URI's scheme, to connect directly to an authority for the target resource.
zh_cn: 如果没有适用的代理，典型的客户端将调用通常特定于目标 URI 方案的处理程序例程，以直接连接到目标资源的权限。

source: If no response body is included, the response MUST include a Content-Length field with a field-value of "0".
zh_cn: 如果不包括响应主体，则响应必须包括具有字段值“0”的 Content-Length 字段。

source: If no such representation exists, then the semantics of the fragment are considered unknown and are effectively unconstrained.
zh_cn: 如果不存在这样的表示，则片段的语义被认为是未知的并且实际上是不受约束的。

source: If no suitable certificate is available, the client MUST send a certificate message containing no certificates.
zh_cn: 如果没有合适的证书，客户端必须发送不包含证书的证书消息。

source: If not empty, the value identifies a session between the same client and server whose security parameters the client wishes to reuse.
zh_cn: 如果不为空，则该值标识客户机希望重用其安全参数的同一客户端和服务器之间的会话。

source: If not, then if a Host header field is supplied with a non-empty field-value, the authority component is the same as the Host field-value.
zh_cn: 如果不是，则如果向 Host 首部字段提供非空字段值，则授权组件与 Host 字段值相同。

source: If not, then if the request-target is in authority-form, the effective request URI's authority component is the same as the request-target.
zh_cn: 如果不是，那么如果请求目标是权限形式，则有效请求 URI 的权限组件与请求目标相同。

source: If not, then it MUST abort the handshake with a "decode_error" alert.
zh_cn: 如果不是，那么它必须通过“decode_error”警报中止握手。

source: If one decides to add a non-empty global error consumer, here is an example that manages the typical undeliverable exceptions based on whether they represent a likely bug or an ignorable application/network state:
zh_cn: 如果决定添加一个非空的全局错误消费者，这里有一个例子来管理典型的无法传递的异常，具体取决于它们是代表可能的错误还是可忽略的应用程序/网络状态：

source: If one has initialization logic after the call to `request(1)` which is needed by `onNext`, you may end up with exceptions:
zh_cn: 如果在调用 `request(1)` 之后有 `onNext` 所需的初始化逻辑，则可能会以异常结束：

source: If one has to handle multiple resources, create a `CompositeSubscription`, associate it with the emitter and then add further resources to the `CompositeSubscription` itself:
zh_cn: 如果必须处理多个资源，创建一个 `CompositeSubscription`，将它与发射器关联，然后将更多资源添加到 `CompositeSubscription` 本身：

source: If one needs those customization, using `NONE` as the backpressure mode and applying the relevant `onBackpressureXXX` on the resulting `Flowable` is the way to go.
zh_cn: 如果需要那些定制，使用 `NONE` 作为背压模式并在生成的 `Flowable` 上应用相关的 `onBackpressureXXX` 是可行的方法。

source: If one or more resources has been created on the origin server as a result of successfully processing a POST request, the origin server SHOULD send a 201 (Created) response containing a Location header field that provides an identifier for the primary resource created (Section 7.1.2) and a representation that describes the status of the request while referring to the new resource(s).
zh_cn: 如果由于成功处理 POST 请求而在源服务器上创建了一个或多个资源，则源服务器应该发送包含 Location 首部字段的 201（Created）响应，该字段提供所创建的主资源的标识符（第 7.1.2 节）以及在引用新资源时描述请求状态的表示。

source: If one was using `Flowable.subscribe(Subscriber<? super T>)` with the built-in RxJava `Subscriber` implementations such as `DisposableSubscriber`, `TestSubscriber` and `ResourceSubscriber`, there is a small runtime overhead (one `instanceof` check) associated when the code is not recompiled against 2.0.7.
zh_cn: 如果使用 `Flowable.subscribe(Subscriber<? super T>)` 和内置的 RxJava `Subscriber` 实现，如 `DisposableSubscriber`，`TestSubscriber` 和 `ResourceSubscriber`，那么在不根据 2.0.7 重新编译代码时，会有一个较小的运行时开销（一个 `instanceof` 检查）。

source: If our SYN has been acknowledged (perhaps in this incoming segment) the precedence level of the incoming segment must match the local precedence level exactly, if it does not a reset must be sent.
zh_cn: 如果我们的 SYN 已被确认(可能在此传入报文段中)，则传入报文段的优先级必须与本地优先级完全匹配，如果不是，则必须发送重置。

source: If our SYN has not been acknowledged and the precedence level of the incoming segment is higher than the precedence level requested then either raise the local precedence level (if allowed by the user and the system) or send a reset; or if the precedence level of the incoming segment is lower than the precedence level requested then continue as if the precedence matched exactly (if the remote TCP cannot raise the precedence level to match ours this will be detected in the next segment it sends, and the connection will be terminated then).
zh_cn: 如果我们的 SYN 未被确认且传入报文段的优先级高于请求的优先级，则提高本地优先级(如果用户和系统允许)或发送重置；或者如果传入报文段的优先级低于请求的优先级，则继续，就好像优先级完全匹配一样(如果远程 TCP 不能提高优先级以匹配我们的优先级将在它发送的下一个报文段中检测到，并且连接将被终止)。

source: If sent by a client, the signature algorithm used in the signature MUST be one of those present in the supported_signature_algorithms field of the "signature_algorithms" extension in the CertificateRequest message.
zh_cn: 如果由客户端发送，则签名中使用的签名算法必须是 CertificateRequest 消息中“signature_algorithms”扩展的 supported_signature_algorithms 字段中存在的签名算法之一。

source: If some of the values can be safely ignored, one can use the sampling (with time or another `Flowable`) and throttling operators (`throttleFirst`, `throttleLast`, `throttleWithTimeout`).
zh_cn: 如果可以安全地忽略某些值，可以使用采样(使用时间或其他 `Flowable`)和限制操作符(`throttleFirst`，`throttleLast`，`throttleWithTimeout`)。

source: If terminating the request message body with a line-ending is desired, then the user agent MUST count the terminating CRLF octets as part of the message body length.
zh_cn: 如果需要使用行结束来终止请求消息体，则用户代理必须将终止 CRLF 八位字节计为消息体长度的一部分。

source: If the "supported_versions" extension in the ServerHello contains a version not offered by the client or contains a version prior to TLS 1.3, the client MUST abort the handshake with an "illegal_parameter" alert.
zh_cn: 如果 ServerHello 中的“supported_versions”扩展包含客户端未提供的版本或包含 TLS 1.3 之前的版本，则客户端必须使用“illegal_parameter”警报中止握手。

source: If the ACK control bit is set this field contains the value of the next sequence number the sender of the segment is expecting to receive.
zh_cn: 如果设置了 ACK 控制位，则该字段包含该报文段的发送者期望接收的下一个序列号的值。

source: If the CertificateVerify message is sent by a server, the signature algorithm MUST be one offered in the client's "signature_algorithms" extension unless no valid certificate chain can be produced without unsupported algorithms (see Section 4.2.3).
zh_cn: 如果服务器发送 CertificateVerify 消息，则签名算法必须是客户端“signature_algorithms”扩展中提供的消息，除非在没有不支持的算法的情况下不能生成有效的证书链(参见第 4.2.3 节)。

source: If the ClientHello.session_id was non-empty, the server will look in its session cache for a match.
zh_cn: 如果 ClientHello.session_id 非空，则服务器将在其会话缓存中查找匹配项。

source: If the Max-Forwards field-value is an integer greater than zero, the proxy MUST decrement the field-value when it forwards the request.
zh_cn: 如果 Max-Forwards 字段值是大于零的整数，则代理必须在转发请求时递减字段值。

source: If the Max-Forwards field-value is zero ("0"), the proxy MUST NOT forward the message; instead, the proxy SHOULD respond with its own communication options.
zh_cn: 如果 Max-Forwards 字段值为零(“0”)，则代理不得转发该消息；相反，代理应该响应自己的通信选项。
